nxp-appcodehub/ap-optimized-voice-ui/optimized_voice_ui/app/cm33/board/pin_mux.c
- {pin_num: N4, pin_signal: PIO1_6/FC5_CTS_SDA_SSEL0/SCT0_GPI4/SCT0_OUT4/FC4_SSEL2/HS_SPI1_SSELN0, label: 'JP26[1]', identifier: SPI_SS0}
- {pin_num: K1, pin_signal: PIO1_4/FC5_TXD_SCL_MISO_WS/HS_SPI1_MISO, label: 'JP26[3]/U4[B3]', identifier: SPI_MISO}
- {pin_num: M5, pin_signal: PIO1_10/MCLK/FREQME_GPIO_CLK/CTIMER_INP10/CLKOUT, label: 'JP27[2]', identifier: MCLK}
- {pin_num: U12, pin_signal: PIO1_29/FLEXSPI0_SS1_N/SCT0_OUT5/UTICK_CAP2/CTIMER_INP13/FLEXSPI0_SCLK_N, label: NC}
- {pin_num: E10, pin_signal: PIO3_15/SD1_D4/LCD_D16/CTIMER3_MAT1/FC5_SCK, label: 'U44[4]/LCM_PWR_EN', identifier: LCM_PWR_EN}
- {pin_num: E5, pin_signal: PIO3_21/SD1_VOLT/LCD_D22/CTIMER4_MAT3/GPIO_INT_BMAT, label: 'J44[21]/LCM_RESET_B', identifier: LCM_RESET_B}
- {pin_num: D17, pin_signal: PIO2_15/SCT0_OUT9/CLKIN/SMARTDMA_PIO15/CMP0_D, label: 'J47[10]/CMP0_D'}
- {pin_num: F16, pin_signal: PIO0_5/FC0_SSEL2/SCT0_GPI0/SCT0_OUT0/CTIMER_INP1/SEC_PIO0_5/ADC0_0, label: 'J30[1]'}
- {pin_num: F17, pin_signal: PIO0_6/FC0_SSEL3/SCT0_GPI1/SCT0_OUT1/CTIMER0_MAT0/SEC_PIO0_6/ADC0_8, label: 'J30[2]'}
- {pin_num: K15, pin_signal: PIO0_11/FC1_RTS_SCL_SSEL1/SCT0_GPI0/SCT0_OUT8/CTIMER_INP2/FC0_SSEL3/SEC_PIO0_11, label: 'J47[8]'}
- {pin_num: E14, pin_signal: PIO0_12/FC1_SSEL2/SCT0_GPI2/SCT0_OUT2/CTIMER_INP3/SEC_PIO0_12/ADC0_1, label: 'U44[5]/LCM_BL_PWM_1V8', identifier: LCM_BL_PWM}
- {pin_num: F15, pin_signal: PIO0_13/FC1_SSEL3/SCT0_GPI3/SCT0_OUT3/CTIMER0_MAT1/SEC_PIO0_13/ADC0_9, label: 'J30[4]'}
- {pin_num: B15, pin_signal: PIO0_15/FC2_TXD_SCL_MISO_WS/SCT0_GPI1/SCT0_OUT1/CTIMER2_MAT1/I2S_BRIDGE_WS_IN/SEC_PIO0_15, label: 'J36[6]/JS6[2]'}
- {pin_num: A16, pin_signal: PIO0_16/FC2_RXD_SDA_MOSI_DATA/SCT0_GPI2/SCT0_OUT2/CTIMER2_MAT2/I2S_BRIDGE_DATA_IN/SEC_PIO0_16, label: 'J36[8]/JS5[2]'}
- {pin_num: B17, pin_signal: PIO0_17/FC2_CTS_SDA_SSEL0/SCT0_GPI3/SCT0_OUT3/CTIMER2_MAT3/FC5_SSEL2/SEC_PIO0_17, label: 'J45[20]/M2_UART_WK_B'}
- {pin_num: B16, pin_signal: PIO0_18/FC2_RTS_SCL_SSEL1/SCT0_GPI6/SCT0_OUT6/CTIMER_INP4/FC5_SSEL3/SEC_PIO0_18, label: 'J45[21]/M2_SD1_WK_B'}
- {pin_num: F13, pin_signal: PIO0_19/FC2_SSEL2/SCT0_GPI4/SCT0_OUT4/CTIMER_INP5/UTICK_CAP0/SEC_PIO0_19/ADC0_2, label: 'J30[3]'}
- {pin_num: A14, pin_signal: PIO0_21/FC3_SCK/SCT0_GPI5/SCT0_OUT5/CTIMER3_MAT0/CTIMER_INP11/TRACECLK/SEC_PIO0_21, label: 'J19[12]'}
- {pin_num: P12, pin_signal: PIO5_0/LCD_D5/DBI_D5/FC12_CTS_SDA_SSELN0/FLEXIO_D12, label: 'J28[3]/J43[7]/FXIO_D12', identifier: RST}
- {pin_num: M9, pin_signal: PIO5_1/LCD_D6/DBI_D6/FC12_RTS_SCL_SSELN1/FLEXIO_D13, label: 'J28[4]/J43[9]/FXIO_D13', identifier: CS}
- {pin_num: R9, pin_signal: PIO5_2/LCD_D7/DBI_D7/FC12_SSELN2/LOW_FREQ_CLKOUT/FLEXIO_D14, label: 'J28[5]/J43[10]/FXIO_D14', identifier: WR}
- {pin_num: R10, pin_signal: PIO5_3/LCD_D8/DBI_D8/FC12_SSELN3/LOW_FREQ_CLKOUT_N/FLEXIO_D15, label: 'J28[6]/J43[11]/FXIO_D15', identifier: RD}
- {pin_num: D13, pin_signal: PIO0_24/FC3_CTS_SDA_SSEL0/SCT0_GPI2/SCT0_OUT9/CTIMER3_MAT3/FC2_SSEL2/TRACEDATA_2/CLKOUT/SEC_PIO0_24, label: 'J19[18]'}
- {pin_num: A12, pin_signal: PIO0_28/FC4_SCK/CTIMER4_MAT0/I2S_BRIDGE_CLK_OUT/SEC_PIO0_28, label: 'U108[A4]', identifier: PSRAM_RESET}
- {pin_num: B11, pin_signal: PIO0_29/FC4_TXD_SCL_MISO_WS/CTIMER4_MAT1/I2S_BRIDGE_WS_OUT/SEC_PIO0_29, label: 'J45[60]/I2C_SCL/U6[4]/ACC_I2C_SCL', identifier: ACC_I2C_SCL}
- {pin_num: D14, pin_signal: PIO0_30/FC4_RXD_SDA_MOSI_DATA/CTIMER4_MAT2/I2S_BRIDGE_DATA_OUT/SEC_PIO0_30, label: 'J45[58]/I2C_SDA/U6[6]/ACC_I2C_SDA', identifier: ACC_I2C_SDA}
- {pin_num: E15, pin_signal: PIO2_14/SCT0_OUT8/CTIMER_INP1/32KHZ_CLKOUT/SMARTDMA_PIO14/CMP0_A, label: 'Q17[1]'}
- {pin_num: A8, pin_signal: PIO3_8/SD1_CLK/LCD_D9/CTIMER0_MAT0/FC10_SCK, label: 'J45[9]/M2_SD1_CLK'}
- {pin_num: B8, pin_signal: PIO3_9/SD1_CMD/LCD_D10/CTIMER0_MAT1/FC10_TXD_SCL_MISO, label: 'J45[11]/M2_SD1_CMD'}
- {pin_num: C8, pin_signal: PIO3_10/SD1_D0/LCD_D11/CTIMER0_MAT2/FC10_RXD_SDA_MOSI, label: 'J45[13]/M2_SD1_DATA0'}
- {pin_num: C10, pin_signal: PIO3_11/SD1_D1/LCD_D12/CTIMER0_MAT3/FC10_CTS_SDA_SSELN0, label: 'J45[15]/M2_SD1_DATA1'}
- {pin_num: A6, pin_signal: PIO3_12/SD1_D2/LCD_D13/CTIMER_INP0/FC10_RTS_SCL_SSELN1, label: 'J45[17]/M2_SD1_DATA2'}
- {pin_num: B7, pin_signal: PIO3_13/SD1_D3/LCD_D14/CTIMER_INP1/FC10_SSELN2, label: 'J45[19]/M2_SD1_DATA3'}
- {pin_num: D9, pin_signal: PIO3_14/SD1_WR_PRT/LCD_D15/CTIMER3_MAT0/SD1_DS/FC10_SSELN3/CMP0_E, label: 'J47[9]/CMP0_E'}
- {pin_num: B6, pin_signal: PIO3_18/SD1_D7/LCD_D19/CTIMER4_MAT0/FC5_CTS_SDA_SSEL0, label: 'J44[22]/LCM_LPTE'}
- {pin_num: C6, pin_signal: PIO3_19/SD1_CARD_DET_N/LCD_D20/CTIMER4_MAT1/MCLK, label: 'U44[6]/LCM_CTP_INT_1V8', identifier: LCM_CTP_INT}
- {pin_num: D6, pin_signal: PIO3_20/SD1_RESET_N/LCD_D21/CTIMER4_MAT2, label: 'J45[23]/M2_SD1_RST_B'}
- {pin_num: R16, pin_signal: PIO3_25/FC6_SCK, label: 'J45[8]/M2_FC6_I2S_BCLK'}
- {pin_num: T16, pin_signal: PIO3_26/FC6_TXD_SCL_MISO_WS, label: 'J45[10]/M2_FC6_I2S_WS'}
- {pin_num: N14, pin_signal: PIO3_27/FC6_RXD_SDA_MOSI_DATA, label: 'J45[14]M2_FC6_I2S_D_OUT'}
- {pin_num: N15, pin_signal: PIO4_0/FC7_SCK/FREQME_GPIO_CLK/CLKOUT, label: 'U117[B2]'}
- {pin_num: M15, pin_signal: PIO4_1/FC7_TXD_SCL_MISO_WS/CLKIN, label: 'J47[5]'}
- {pin_num: M14, pin_signal: PIO4_3/FC7_CTS_SDA_SSEL0, label: 'J47[7]'}
- {pin_num: P17, pin_signal: PIO4_4/FC7_RTS_SCL_SSEL1/FC1_SCK, label: 'U44[3]/LCM_CTP_RST_1V8', identifier: LCM_CTP_RST_B}
- {pin_num: M17, pin_signal: PIO4_2/FC7_RXD_SDA_MOSI_DATA, label: 'J45[12]/M2_FC7_I2S_D_IN'}
- {pin_num: P15, pin_signal: PIO4_6/FC7_SSEL3/FC1_RXD_SDA_MOSI_DATA, label: 'J47[6]'}
- {pin_num: P16, pin_signal: PIO4_5/FC7_SSEL2/FC1_TXD_SCL_MISO_WS, label: 'U24[13]'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_gpio.h"
#include "fsl_iopctl.h"
#include "fsl_inputmux.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
    BOARD_InitDEBUG_UARTPins();
    BOARD_InitDMICPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: K4, peripheral: FLEXCOMM15, signal: SCL, pin_signal: PMIC_I2C_SCL, pupdena: disabled, pupdsel: pullDown, ibena: enabled, odena: enabled}
  - {pin_num: K6, peripheral: FLEXCOMM15, signal: SDA, pin_signal: PMIC_I2C_SDA, pupdena: disabled, pupdsel: pullDown, ibena: enabled, odena: enabled}
  - {peripheral: FUSIONF1, signal: 'DSP_INTERRUPT, 1', pin_signal: MU_B}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

